{
  "FST Marrakech": "La Faculté des Sciences et Techniques Marrakech (FST Marrakech) est située au B.P. 549, Av. Abdelkarim Elkhattabi, Guéliz, Marrakech. Vous pouvez la joindre au téléphone au (+212) 524 43 34 04, et par fax au (+212) 524 43 31 70.",
  
  "Doyen de la FSTG": "Le Doyen de la FST Marrakech est le Pr. Said RAKRAK. Vous pouvez le contacter par email à doyen@fstg-marrakech.ac.ma.",
  
  "Vice-Doyen chargé des affaires pédagogiques de la FSTG": "Le Vice-Doyen chargé des affaires pédagogiques de la FSTG est le Pr. Bachnou. Vous pouvez le joindre par email à vice-doyen@fstg-marrakech.ac.ma.",
  
  "Vice-Doyen chargé de la coopération et de la recherche scientifique de la FSTG": "Le Vice-Doyen chargé de la coopération et de la recherche scientifique de la FSTG est le Pr. Cherkaoui El MODAFAR. Vous pouvez le contacter par email à elmodafar@fstg-marrakech.ac.ma.",
  
  "Secrétaire Général de la FSTG": "Le Secrétaire Général de la FSTG est M. Mohamed JBILOU. Vous pouvez le joindre par email à sg@fstg-marrakech.ac.ma.",
  
  "Service Coopération et Recherche de la FSTG": "Le responsable du Service Coopération et Recherche de la FSTG est Mme Fatiha Chayeb. Vous pouvez la contacter par email à f.chayeb@uca.ac.ma.",
  
  "Service de Scolarité de la FSTG": "Le responsable du Service de Scolarité de la FSTG est M. Mahmoud Belfaqir. Vous pouvez le joindre par email à fstg_sco@uca.ma.",
  
  "Cellule Informatique de la FSTG": "Le responsable de la Cellule Informatique de la FSTG est M. Khalid MAHROU. Vous pouvez le contacter par email à mahrou@fstg-marrakech.ac.ma.",
  
  "Communication / Interface de la FSTG": "Le service Communication / Interface de la FSTG est assuré par Mme Fatiha Chayeb. Vous pouvez la joindre aux adresses f.chayeb@uca.ac.ma ou fstg.communication@uca.ma.",
  
  "Responsable Cycle Master de la FSTG": "Le responsable du Cycle Master de la FSTG est M. Lahcen BELLHARI. Vous pouvez le contacter par email à l.bellhari@uca.ac.ma.",
  
  "Responsable Cycle Ingénieur de la FSTG": "Le responsable du Cycle Ingénieur de la FSTG est M. Mahmoud Belfaqir. Vous pouvez le joindre par email à mbelfaqir@uca.ma.",
  
  "Responsable Cycle Doctoral de la FSTG": "Le responsable du Cycle Doctoral de la FSTG est M. Azeddine Lemtouni. Vous pouvez le contacter par email à a.lemtouni@uca.ma."
}
