{
  "Génie Civil, Bâtiment et Travaux Publics (FST Marrakech)": "Licence en sciences et techniques coordonnée par Pr. Bouferra Rachid à la Faculté des Sciences et Techniques de Marrakech. Langue d’enseignement : français. Objectifs : former des spécialistes du BTP et génie civil capables de concevoir, dimensionner et réaliser des ouvrages (géotechnique, calcul de structures, DAO/CAO, topographie, architecture). Compétences acquises : mécanique des milieux continus, résistance des matériaux, simulation, gestion de projet, modélisation numérique, décision. Débouchés : grandes entreprises du génie civil, bureaux d’études, collectivités, maîtrise d’œuvre/ouvrage, aménagement urbain, thermique du bâtiment, réseaux. Modalités d’accès : étude du dossier. Programme :\n• Sem. 1 : Analyse 1; Algèbre 1; Circuits électriques & électroniques; Électricité; Algorithmique 1; Langues (anglais/français/espagnol); Méthodologie universitaire.\n• Sem. 2 : Analyse 2; Algèbre 2; Structure de la matière; Mécanique & optique géométrique; Thermodynamique; Langues; Culture digitale.\n• Sem. 3 : Analyse 3; Électromagnétisme; Mécanique des solides; Statistiques & probabilités; Algorithmique 2; Langues; Arts.\n• Sem. 4 : Analyse 4; Analyse numérique; Optique physique; Mécanique des fluides; Structures de données; Langues; Développement personnel.\n• Sem. 5 : Mécanique des milieux continus; Résistance des matériaux avancée; Topographie & architecture; Efficacité énergétique du bâtiment; Environnement & marchés publics; Langues; Excel avancé.\n• Sem. 6 : Matériaux de construction & béton armé; Modélisation numérique & BIM; Mécanique des sols; Langues; Droit, civisme & citoyenneté.\nURL : https://www.uca.ma/fr/formations/formation-initiale/genie-civil-batiment-et-travaux-publics",

  "Ingénierie de l'Eau et des Géosciences (FST Marrakech)": "Licence en sciences et techniques coordonnée par Pr. Moustadraf Jalal à la Faculté des Sciences et Techniques de Marrakech. Langue d’enseignement : français. Objectifs : former des experts en hydrogéologie, hydrologie, géologie, géophysique, traitement & dessalement de l’eau, IA appliquée aux ressources hydriques, gestion durable, modélisation & prévention des risques naturels. Compétences : modélisation hydrologique & géologique, prospection géophysique, AI & Big Data pour eau, analyse environnementale, innovation & recherche, communication, gestion de projet. Débouchés : bureaux d’études, entreprises de dessalement & traitement d’eau, organismes publics (ONEE, ABH, ONEP), collectivités, laboratoires de recherche. Modalités d’accès : étude du dossier, test écrit, entretien oral. Programme :\n• Sem. 1 : Pétrographie & minéralogie; Géologie structurale; Dynamique sédimentaire; Stratigraphie; Informatique & Excel; Langues.\n• Sem. 2 : Géochimie appliquée; Géologie du Maroc; Hydrologie; Hydrogéologie; Bassins sédimentaires; Arts; Langues.\n• Sem. 3 : Gisements & exploration; Eau potable & assainissement; Géologie des phosphates & hydrocarbures; Dessalement & déminéralisation; Géostatistiques; Informatique; Langues.\n• Sem. 4 : Géomatique; Forages & aménagement hydraulique; Modélisation des hydrosystèmes; Géophysique; Hydrogéochimie; Management & entrepreneuriat; Langues.\n• Sem. 5 : Géotechnique; Sols & littoraux; Géoinformatique; Recherche opérationnelle; École de terrain; Employment skills; Langues.\nURL : https://www.uca.ma/fr/formations/formation-initiale/ingenierie-de-leau-et-des-geosciences",

  "Sciences et Techniques – Chimie des Matériaux (FST Marrakech)": "Licence en sciences et techniques coordonnée par Pr. Khachane Manar à la Faculté des Sciences et Techniques de Marrakech. Langue d’enseignement : français. Objectifs : dispenser un tronc commun physico-chimique pour préparer à la spécialisation en chimie des matériaux (métaux, céramiques, polymères, composites) autour de l’élaboration, des propriétés et des applications. Compétences : élaboration & caractérisation de matériaux, optimisation de synthèses et procédés, maîtrise des méthodes analytiques, rédaction & présentation scientifique. Débouchés : contrôle qualité matériaux, poursuite en master chimie des matériaux ou génie des matériaux & procédés. Modalités d’accès : étude du dossier. Programme :\n• Sem. 1 : Analyse 1; Algèbre 1; Électricité; Circuits électriques & électroniques; Algorithmique 1; Langues; Méthodologie.\n• Sem. 2 : Analyse 2; Algèbre 2; Thermodynamique; Mécanique & optique géométrique; Structure de la matière; Langues; Culture digitale.\n• Sem. 3 : Statistiques & probabilités; Chimie organique 1; Biochimie structurale; Réactivité chimique; Chimie minérale 1; Langues; Arts.\n• Sem. 4 : Chimie organique 2; Chimie minérale 2; Génie chimique; Thermochimie & cinétique; Analyse de données; Langues; Développement personnel.\n• Sem. 5 : Classes de matériaux; Électrochimie & analytique; Thermodynamique des solutions; Génie chimique 2; Cristallographie; Langues; Excel avancé.\n• Sem. 6 : Caractérisation des matériaux; Chimie macromoléculaire; Chimie organique avancée; Langues; Droit & citoyenneté.\nURL : https://www.uca.ma/fr/formations/formation-initiale/chimie-des-materiaux",

  "Bio-Analyses appliquées à la santé et à l’environnement (FST Guéliz)": "Licence en sciences et techniques coordonnée par Pr. Bouamama Hafida à la Faculté des Sciences et Techniques de Guéliz, Marrakech. Langue d’enseignement : français. Objectifs : former des techniciens supérieurs capables de réaliser contrôles qualité et analyses biologiques pour la santé et l’environnement, en combinant enseignement académique et technique professionnalisant, avec stages pratiques. Compétences : maîtrise des méthodes analytiques (identification, quantification, traçabilité), mise en œuvre de la démarche qualité, expertises bio-chimiques, immunologiques et écotoxicologiques. Débouchés : laboratoires hospitaliers, analyses médicales, industrie pharmaceutique, services hygiène, laboratoires environnementaux, recherche. Modalités d’accès : étude de dossier. Programme :\n• Sem. 1 : Biologie cellulaire; Structure de la matière; Analyse/algèbre; Cosmologie & géodynamique interne; Optique & radioactivité; Langues; Méthodologie universitaire.\n• Sem. 2 : Culture digitale; Langues; Biologie animale & végétale; Réactivité chimique; Thermodynamique & mécanique des fluides; Géodynamique externe; Bases de données.\n• Sem. 3 : Culture & art; Langues; Biochimie structurale; Histologie & embryologie; Microbiologie; Chimie organique; Statistiques & probabilités.\n• Sem. 4 : Développement personnel; Langues; Analyse de données; Biochimie métabolique & enzymologie; Biologie moléculaire & génétique; Méthodes d’analyse chimique & biologique; Physiologie animal & végétal.\n• Sem. 5 : Techniques biochimiques, immuno, qualité & métrologie; Techniques génomiques; Biostatistiques; Génétique des populations; Immunologie & immunopathologie; Écologie & biodiversité; Python & algorithmique; Langues.\n• Sem. 6 : Langues; Analyses bactériologiques, virologiques & mycologiques; Biochimie clinique & génétique humaine; Hématologie & parasitologie; Droit & citoyenneté; Analyses biologiques environnement; Écotoxicologie; Chimie de l’environnement.\nURL : https://www.uca.ma/fr/formations/formation-initiale/bio-analyses",

  "Ingénierie des Productions Végétales (FST Guéliz)": "Licence en sciences et techniques coordonnée par Pr. Aissam Salama à la Faculté des Sciences et Techniques de Guéliz, Marrakech. Langue d’enseignement : français. Objectifs : préparer des ingénieurs agronomes à maîtriser techniques avancées de sélection, culture et gestion durable des plantes, en intégrant stages et projets de recherche. Compétences : gestion de cultures, physiologie végétale, expérimentation & analyse de données, biotechnologies végétales, bioinformatique. Débouchés : chargé de projet agricole, conseiller agronomie, R&D, responsable de production, développement rural, entrepreneur agricole. Modalités d’accès : étude de dossier. Programme :\n• Sem. 1 : Analyse & algèbre; Biologie cellulaire; Cosmologie & géodynamique interne; Optique & radioactivité; Structure de la matière; Langues; Méthodologie universitaire.\n• Sem. 2 : Bases de données; Biologie animale & végétale; Thermodynamique & fluides; Géodynamique externe; Réactivité chimique; Langues; Culture digitale.\n• Sem. 3 : Statistiques & probabilités; Chimie organique 1; Histologie & embryologie; Microbiologie; Biochimie structurale; Langues; Arts.\n• Sem. 4 : Physiologie animale & végétale; Méthodes d’analyse chimique & biologique; Biologie moléculaire & génétique; Biochimie métabolique & enzymologie; Analyse de données; Langues; Développement personnel.\n• Sem. 5 : Pédologie & microbiologie du sol; Langues; Python & algorithmique; Techniques génomiques; Génétique & biostatistiques; Nutrition carbonée & hydrique des plantes.\n• Sem. 6 : Phytopathologie & stress abiotiques; Biotechnologie végétale & ressources génétiques; Omics; Production végétale systématique; Bioinformatique; Langues; Droit & citoyenneté.\nURL : https://www.uca.ma/fr/formations/formation-initiale/ingenierie-des-productions-vegetales",

  "Géologie appliquée aux ressources minières (FST Guéliz)": "Licence en sciences et techniques coordonnée par Pr. Erragragui Mohamed à la Faculté des Sciences et Techniques de Guéliz, Marrakech. Langue d’enseignement : français. Objectifs : former des géologues opérationnels pour l’exploration et la gestion des ressources minières, maîtrisant méthodes d’investigation et analyses géoscientifiques. Compétences : exploration minière, métallogénie, pétrologie, géologie structurale, sédimentologie, stratigraphie, prospection géochimique & géophysique. Débouchés : OCP, ONHYM, bureaux d’études, sociétés minières, laboratoires, collectivités, poursuite en Master/ingénierie. Modalités d’accès : étude de dossier. Programme :\n• Sem. 1 : Analyse/algèbre; Biologie cellulaire; Cosmologie & géodynamique interne; Optique & radioactivité; Structure de la matière; Langues; Méthodologie universitaire.\n• Sem. 2 : Bases de données; Biologie animale & végétale; Géodynamique externe; Thermodynamique & fluides; Réactivité chimique; Langues; Culture digitale.\n• Sem. 3 : Statistiques & probabilités; Paléoenvironnement & stratigraphie; Pétrographie & minéralogie; Géomatique; Chimie minérale; Langues; Arts.\n• Sem. 4 : Géologie structurale; Méthodes d’analyse chimique & biologique; Chimie organique; Hydrologie & hydrogéologie; Analyse de données; Langues; Développement personnel.\n• Sem. 5 : Géologie structurale avancée; Dynamique sédimentaire; Prospection géochimique & géophysique; Pétrographie des roches cristallines; Géologie endogène; Langues; Compétences numériques.\n• Sem. 6 : Hydrogéologie; Géologie du Maroc; Géologie exogène; Langues; Droit & citoyenneté.\nURL : https://www.uca.ma/fr/formations/formation-initiale/geologie-appliquee-aux-ressources-minieres-garm",

  "Génie des Matériaux et Procédés (FST Marrakech)": "Diplôme d'ingénieur d'État coordonné par Pr. Abdelouahdi Karima à la Faculté des Sciences et Techniques de Marrakech. Langue d’enseignement : français. Objectifs : former des ingénieurs matériaux capables de concevoir, modéliser, élaborer et caractériser matériaux organiques et inorganiques (plastiques, composites, céramiques…), en phase avec la stratégie nationale « Emergence » et le Programme NAJAH, via un enseignement scientifique, technique, industriel et recherche. Compétences : modélisation des procédés, caractérisation structurale et thermique, contrôle qualité, conception VLSI, corrosion, fatigue, instrumentation, simulation et IA appliquée aux matériaux. Débouchés : industries de transformation, bureaux d’études, R&D, qualité, bureaux d’études, création d’entreprises ou poursuite en doctorat. Modalités d’accès : étude de dossier, test écrit, entretien. Programme :\n• Semestre 1 : Outils mathématiques, Thermodynamique des solutions, Dynamiques des fluides & rhéologie, Chimie macromoléculaire, Propriétés électriques et thermiques, Excel avancé, Langues.\n• Semestre 2 : Électrochimie & méthodes, Métallurgie structurale, Propriétés mécaniques, Verres & couches minces, Physique semi-conducteurs, Arts & culture, Langues.\n• Semestre 3 : Automatisme industriel, Machines thermiques, Propriétés des polymères, Spectrométrie & chromatographie, Chimie industrielle, IA & IoT, Langues.\n• Semestre 4 : Caractérisation structurale & thermique, Interfaces, Métallurgie descriptive, Plan d’expérience, Fatigue & rupture, Management de projet.\n• Semestre 5 : Matériaux composites & biopolymères, Capteurs & instrumentation, Contrôle non destructif, Corrosion & protection, Fabrication mécanique, Compétences pro, Langues.\nURL : https://www.uca.ma/fr/formations/formation-initiale/genie-des-materiaux-et-procedes",

  "Énergies Renouvelables et Mobilité Électrique (FST Marrakech)": "Diplôme d'ingénieur d'État coordonné par Pr. Belkhyat Zoukkari Driss à la Faculté des Sciences et Techniques de Marrakech. Langue d’enseignement : français. Objectifs : former des ingénieurs pluridisciplinaires en génie électrique, électronique, automatique, informatique et énergies renouvelables (solaire photovoltaïque et thermique, éolien) et mobilité électrique, en phase avec les projets NOOR, NAJAH et l’essor industriel. Compétences : conception, audit et optimisation d’installations renouvelables, simulation et CAO/DAO, régulation industrielle, réseaux intelligents, chaîne de traction électrique, management de projet et transition énergétique. Débouchés : bureaux d’études, ingénieur études, responsable R&D, technico-commercial énergies, chargé de projets mobilité, directeur de programmes. Modalités d’accès : étude de dossier, test écrit, entretien. Programme :\n• Semestre 1 : Électronique analogique, Traitement du signal, Systèmes numériques embarqués, Semi-conducteurs & photovoltaïque, Analyse numérique, Excel avancé, Langues.\n• Semestre 2 : Télécommunications & CEM, Microcontrôleurs & temps réel, Électrotechnique 1, Automatique 1, Probabilités & recherche opérationnelle, Arts, Langues.\n• Semestre 3 : IA & IoT, Réseaux & protocoles, Automatique 2, Électrotechnique 2, Actionneurs & capteurs, Dessin industriel, Langues.\n• Semestre 4 : Électronique de puissance, Régulation industrielle, Machines électriques, Réseaux industriels, Projets & réalisations, Management, Langues.\n• Semestre 5 : Énergies renouvelables & transition (audit, normes), Stockage & cogénération, Commande avancée, Mobilité électrique & chaîne de traction, Réseaux intelligents, Compétences pro, Langues.\nURL : https://www.uca.ma/fr/formations/formation-initiale/energies-renouvelables-et-mobilite-electrique",

  "Physique Appliquée et Ingénierie (FST Marrakech)": "Licence en sciences et techniques coordonnée par Pr. Zriouel Sanae à la Faculté des Sciences et Techniques de Marrakech. Langue d’enseignement : français. Objectifs : donner une solide formation de base en physique des matériaux et techniques d’analyse (métrologie, caractérisation, contrôle non destructif) pour faciliter l’accès au master et l’intégration professionnelle. Compétences : analyse numérique, instrumentation, simulation, programmation, métrologie, caractérisation (optique, thermique, électronique), gestion de projets et communication scientifique. Débouchés : master Matériaux & Énergie Appliquée, laboratoires d’analyses & contrôle, bureaux d’études, industrie des matériaux. Modalités d’accès : étude de dossier. Programme :\n• Semestre 1 : Analyse & Algèbre, Électricité, Circuits, Algorithmique 1, Méthodologie, Langues.\n• Semestre 2 : Thermodynamique, Mécanique & optique, Structure de la matière, Culture digitale, Langues.\n• Semestre 3 : Statistiques & probabilités, Mécanique solide, Électromagnétisme, Algorithmique 2, Arts, Langues.\n• Semestre 4 : Analyse numérique & avancée, Mécanique des fluides, Optique physique, Structures de données, Développement personnel.\n• Semestre 5 : Physique pour l’ingénieur, Physique quantique, Semi-conducteurs & électronique, Physique des matériaux, Métrologie & capteurs, Excel avancé, Langues.\n• Semestre 6 : Énergies renouvelables & stockage, Simulation & mini-projet, Contrôle non destructif, Arts, Langues.\nURL : https://www.uca.ma/fr/formations/formation-initiale/physique-appliquee-et-ingenierie",

  "Industrie et Sécurité des Aliments (FST Marrakech)": "Diplôme d'ingénieur d'État coordonné par Pr. Chakir Mohamed à la Faculté des Sciences et Techniques de Marrakech. Langue d’enseignement : français. Objectifs : former des cadres pluridisciplinaires experts en production, sécurité sanitaire et conformité des produits alimentaires, capables de diriger des équipes et conduire des projets. Option 1 « Management de la sécurité sanitaire des aliments » : maîtrise des référentiels IAA, audits, formation du personnel, accompagnement à la certification. Option 2 « Conception des Aliments et Innovation » : R&D, développement de produits alimentaires adaptés aux critères qualité, sécurité et contraintes socio-économiques. Compétences : conduite de procédés, connaissance des matières premières et produits finis, maîtrise des dangers microbiologiques et chimiques, conception et innovation, réglementation nationale et internationale, élaboration de normes, gestion de projets R&D, communication, travail en équipe, apprentissage continu, responsabilité et éthique. Débouchés : ingénieur qualité, responsable production, ingénieur procédés, cadre de contrôle et conseil, responsable qualité/hygiène/environnement IAA, R&D, chef d’entreprise, et ouverture vers secteur pharmaceutique, cosmétique et chimique. Modalités d’accès : étude du dossier, test écrit, entretien oral. Programme :\n• Semestre 1 : Bioénergétique & métabolisme; Enzymologie & ingénierie génétique; Techniques analytiques & méthodes optiques/électrochimiques; Bases de données & SQL; Biostatistique; Langues I; Excel avancé.\n• Semestre 2 : Biochimie des aliments; Analyse de données & plans d’expérience; Mécanique des fluides & thermodynamique; Physiologie microbienne; Alimentation & nutrition; Langues II; Art & culture.\n• Semestre 3 : Élaboration & transformation des aliments (végétal/animal); Conservation & dégradation; Parasitologie, virologie & allergies alimentaires; Pathogènes & mycotoxines; Physique industrielle; Langues III; IA & IoT.\n• Semestre 4 : Génie des procédés 1; Management qualité, métrologie & production; Chimie-physique des aliments, formulation & analyse sensorielle; HACCP & hygiène IAA; Génie des procédés 2; Langues IV; Management de projet.\n• Semestre 5 : Innovation & sécurité alimentaire; Référentiels & législation sécurité sanitaire; Toxicologie alimentaire; Développement durable & management environnemental; Compétences pro; Langues V; Caractérisation des matières premières; Génie de la formulation & rhéologie; Projet pluridisciplinaire.\nURL : https://www.uca.ma/fr/formations/formation-initiale/industrie-et-securite-des-aliments",

  "Mathématiques Appliquées et Sciences des Données (FST Marrakech)": "Licence en sciences et techniques coordonnée par Pr. Akdim Khadija à la Faculté des Sciences et Techniques de Marrakech. Langue d’enseignement : français. Objectifs : fournir une base solide en analyse, algèbre, topologie, calcul différentiel et intégration, méthodes numériques, optimisation avancée, statistique, modélisation géométrique, programmation Python et machine learning, complétée par le développement de soft skills et modules linguistiques. Compétences : modélisation mathématique, analyse de données, programmation Python, machine learning, communication, travail d’équipe et gestion du temps. Débouchés : concours administratifs, insertion professionnelle en data science (banques, bureaux d’études, entreprises), accès aux masters et écoles d’ingénieurs (INPT, EMI, EHTP, ENSIAS, ENSA…), et admission en 2ᵉ année cycle ingénieur. Modalités d’accès : étude du dossier. Programme :\n• Semestre 1 : Algèbre 1; Circuits électriques & électroniques; Analyse 1; Électricité; Algorithmique & programmation 1; Langues; Méthodologie universitaire.\n• Semestre 2 : Analyse 2; Algèbre 2; Thermodynamique; Mécanique & optique géométrique; Structure de la matière; Langues; Culture digitale.\n• Semestre 3 : Statistiques & probabilités; Algorithmique & programmation 2; Analyse 3; Enquêtes & sondage; Algèbre 3; Langues; Arts.\n• Semestre 4 : Analyse numérique; Analyse 4; Systèmes d’information & bases de données; Régression linéaire; Inférence statistique; Langues; Développement personnel.\n• Semestre 5 : Topologie & calcul différentiel; Méthodes numériques pour la data; Intégration & probabilité; Modélisation géométrique; Modèles linéaires avancés; Langues; Python & algorithmique.\n• Semestre 6 : Statistique bayésienne; Optimisation pour la data; Machine learning; Langues; Droit, civisme & citoyenneté.\nURL : https://www.uca.ma/fr/formations/formation-initiale/mathematiques-appliquees-et-sciences-des-donnees",

  "Ingénierie en Finance et Actuariat (FST Marrakech)": "Diplôme d'ingénieur d'État coordonné par Pr. Daafi Boubker à la Faculté des Sciences et Techniques de Marrakech. Langue d’enseignement : français. Objectifs : former des ingénieurs mathématiciens spécialisés en finance de marché et actuariat, maîtrisant méthodes statistiques, économétriques, numériques et informatiques pour résoudre des problématiques financières, d’assurance et industrielles. Compétences : gestion des risques financiers, optimisation de portefeuilles, conformité réglementaire, communication des résultats, innovation, business intelligence, leadership en équipe multidisciplinaire. Débouchés : consultant actuariat, gestionnaire de risques, analyste fintech, régulateur, enseignant-chercheur, trader quantitatif, gestionnaire de portefeuille, analyste quantitatif. Modalités d’accès : étude du dossier, test écrit, entretien oral. Programme :\n• Sem. 1 : Topologie & calcul différentiel; Analyse numérique; Théorie de la mesure & intégration; Mathématiques financières I (gestion obligataire); Python; Modèles linéaires avancés; Langues.\n• Sem. 2 : Recherche opérationnelle & optimisation; Probabilités; Analyse fonctionnelle & EDP; Statistique bayésienne; Science des données; Langues; Art & culture.\n• Sem. 3 : Assurance vie; Économétrie panel; Instruments financiers; Processus stochastiques & actuariat; Mathématiques financières II (portefeuille); Langues; IA en finance.\n• Sem. 4 : Séries temporelles; Assurance non-vie & réassurance; Courbes de taux; Calcul stochastique; Théorie de décision; Langues; Management de projets.\n• Sem. 5 : Contrôle des risques financiers; Options & modèles stochastiques; Modèles discrets en finance; Économétrie financière; Monte Carlo avancé; Langues; Compétences pro.\nURL : https://www.uca.ma/fr/formations/formation-initiale/ingenierie-en-finance-et-actuariat-40",

  "Génie Civil (FST Marrakech)": "Diplôme d'ingénieur d'État coordonné par Pr. Zoubir Amine à la Faculté des Sciences et Techniques de Marrakech. Langue d’enseignement : français. Objectifs : former des ingénieurs capables de concevoir, construire, réhabiliter et sécuriser ouvrages et infrastructures (bâtiments, ponts, routes, réseaux d’eau) en intégrant exigences environnementales et BIM. Compétences : mécanique des milieux continus, géotechnique, topographie, CAO/BIM, dimensionnement structures, gestion de projet, leadership, réglementation BT. Débouchés : bureaux d’études, chantiers, laboratoires, administrations infrastructures, enseignant-chercheur, direction PME BTP. Modalités d’accès : étude du dossier, test écrit, entretien oral. Programme :\n• Sem. 1 : Méthodes numériques; Mécanique continuo; Géologie Ingénieur; Topographie & SIG; Matériaux; Langues; Excel.\n• Sem. 2 : Hydraulique & hydrologie; Énergétique du bâtiment; RDM & statique; Architecture & DAO/CAO; Géotechnique; Langues; Art.\n• Sem. 3 : Assainissement & voiries; RDM 2; Béton armé 1; Calcul structures; Procédés construction; Langues; IA & IoT.\n• Sem. 4 : Béton précontraint; Ouvrages hydrauliques; Éléments finis; Béton armé 2; Routes; Langues; Management.\n• Sem. 5 : Construction métallique; Ponts & ouvrages d’art; Dynamique & parasismique; Marchés publics; Géotechnique avancée; Langues; Compétences pro.\nURL : https://www.uca.ma/fr/formations/formation-initiale/genie-civil",

  "Cybersecurity (FST Marrakech)": "Licence en sciences et techniques coordonnée par Pr. El Boushaki Abdessamad à la Faculté des Sciences et Techniques de Marrakech. Langue d’enseignement : anglais. Objectifs : former des professionnels de la cybersécurité maîtrisant politiques de sécurité, gestion des risques, conformité RGPD, protection des données. Compétences : mise en œuvre de mécanismes de sécurité réseau/système, tests d’intrusion, sensibilisation utilisateurs, analyse d’alertes, réponse aux incidents, monitoring des vulnérabilités. Débouchés : administrateur sécurité, analyste SOC, pentester, ingénieur sécurité, consultant, entry en école d’ingénieurs, concours administratifs. Modalités d’accès : étude du dossier. Programme :\n• Sem. 1 : Analyse 1; Algèbre 1; Circuits & électricité; Algorithmique 1; Langues; Méthodologie.\n• Sem. 2 : Analyse 2; Algèbre 2; Thermodynamique; Mécanique & optique; Structure matière; Langues; Culture digitale.\n• Sem. 3 : Statistiques & probabilités; Analyse 3; Architecture ordinateurs; Microcontrôleurs; Algorithmique 2; Langues; Arts.\n• Sem. 4 : Analyse numérique & Python; RO; SI & bases de données; Dév. Web; Structures données; Langues; Dév. perso.\n• Sem. 5 : Cryptographie; Réseaux & protocoles; Admin Linux; Programmation avancée; Cloud computing; Langues; Excel.\n• Sem. 6 : Sécurité réseaux & systèmes; Audit & pen-testing; Réseaux avancés; Langues; Droit & citoyenneté.\nURL : https://www.uca.ma/fr/formations/formation-initiale/cybersecurity",

  "Développement Full Stack et DevOps (FST Marrakech)": "Licence en sciences et techniques coordonnée par Pr. Bourquia Nawal à la Faculté des Sciences et Techniques de Marrakech. Langue d’enseignement : français. Objectifs : former des techniciens spécialisés capables de concevoir, intégrer et exploiter des architectures matérielles et logicielles Full Stack (web, mobile) et DevOps, en maîtrisant génie logiciel, conteneurisation, CI/CD et sécurité. Compétences : programmation objet, qualité logicielle, gestion de versions, web réparti, bases de données distribuées, administration SGBD, UML, méthodes agiles, cloud, orchestration et mobile. Débouchés : administrateur de bases de données, développeur Full Stack, ingénieur DevOps, chef de projet technologique. Modalités d’accès : étude du dossier. Programme :\n• Sem. 1–2 : Algèbre, Analyse, Algorithmique, Circuits & électrotechnique, Langues, Méthodologie universitaire.\n• Sem. 3 : Algorithmique avancée, Architecture ordinateurs, Microcontrôleurs, Statistiques.\n• Sem. 4 : Numérique, Web 1, RO, Systèmes & BD, Structures de données.\n• Sem. 5 : UML & agilité, JS / Full Stack, Réseaux, Cloud, Programmation avancée.\n• Sem. 6 : Mobile, Back-end & Web services, DevOps & sécurité, Droit & citoyenneté.\nURL : https://www.uca.ma/fr/formations/formation-initiale/developpement-web-full-stack-et-devops",

  "Sécurité des Systèmes d’Information (FST Marrakech)": "Diplôme d’ingénieur d’État coordonné par Pr. Rakrak Said à la Faculté des Sciences et Techniques de Marrakech. Langue d’enseignement : français. Objectifs : fournir une approche globale de la sécurité des SI, incluant conception, audits, tests d’intrusion, gestion des incidents et conformité réglementaire. Compétences : architecture matérielle/logicielle, cryptographie, normes, hacking éthique, pentesting, détection et réponse aux cyberattaques, protection des données. Débouchés : ingénieur systèmes & réseaux, cryptologue, administrateur sécurité, consultant cybersécurité, chef de projet, architecte sécurité, auditeur. Modalités d’accès : dossier, test écrit, entretien. Programme :\n• Sem. 1–2 : SI, maths, Java OO, OS, réseaux, cyber-droit, back-end web.\n• Sem. 3 : Cryptographie, IA & IoT, UML, front-end, mobile, Java sécurisée.\n• Sem. 4 : Agile & DevOps, hacking éthique, sécurité réseaux & systèmes, virtualisation.\n• Sem. 5 : Gouvernance & risques, sécurité applicative, incident response, blockchain & cloud.\nURL : https://www.uca.ma/fr/formations/formation-initiale/securite-it",

  "Eau et Environnement – Exploration & Exploitation des Ressources en Eau (FST Marrakech)": "Licence en sciences et techniques coordonnée par Pr. Igmoullan Brahim à la Faculté des Sciences et Techniques de Marrakech. Langue d’enseignement : français. Objectifs : former des techniciens supérieurs capables d’explorer, exploiter et gérer durablement les ressources hydriques tout en préservant l’environnement. Compétences : hydrologie, hydrogéologie, hydrochimie, géomatique, prospection, qualité de l’eau, analyse de données environnementales. Débouchés : opérateur de ressources en eau, consultant eau-environnement, technicien de bureaux d’études, administrations publiques, poursuite en master/Mastère spécialisé ou écoles d’ingénieurs. Modalités d’accès : étude du dossier. Programme :\n• Sem. 1–2 : Biologie cellulaire, optique, structure de la matière, géodynamique, algèbre, méthodes, BD.\n• Sem. 3 : Statistiques, stratigraphie, géomatique, minéralogie, hydrologie, art & langues.\n• Sem. 4 : Géologie structurale, hydrogéologie, analyses, développement personnel.\n• Sem. 5 : Exploration géochimique & géophysique, sols & risques, compétences numériques.\n• Sem. 6 : Hydrogéologie & qualité de l’eau, géologie du Maroc, droit & citoyenneté.\nURL : https://www.uca.ma/fr/formations/formation-initiale/eau-et-environnement-exploration-et-exploitation-des-ressources-en-eau",

  "Informatique, Électronique, Électrotechnique & Automatique (IEEA) (FST Marrakech)": "Licence en sciences et techniques coordonnée par Pr. Chakir El Alaoui El Houcine à la Faculté des Sciences et Techniques de Marrakech. Langue d’enseignement : français. Objectifs : dispenser une formation solide en génie électrique (électronique, électrotechnique, automatique, informatique industrielle) alliant théorie et pratique, pour répondre à la demande croissante des industries. Compétences : électronique analogique & numérique, électrotechnique, capteurs & instrumentation, automatique, informatique industrielle, modélisation, stage industriel. Débouchés : technicien supérieur en automatisme, électrotechnique, électronique, systèmes embarqués, maintenance, poursuite en master/école d’ingénieurs. Modalités d’accès : dossier. Programme :\n• Sem. 1–2 : Algèbre, algorithmique, analyse, circuits, électricité, langues, méthodologie.\n• Sem. 3 : Capteurs, électromagnétisme, électronique analogique, stats.\n• Sem. 4 : Analyse numérique, automatique, électronique numérique, électrotechnique.\n• Sem. 5 : Traitement du signal, informatique industrielle, fonctions électroniques, machines, régulation.\n• Sem. 6 : Électronique de puissance, automatismes séquentiels, projet.\nURL : https://www.uca.ma/fr/formations/formation-initiale/informatique-electronique-electrotechnique-et-automatique-ieea",

  "Réseaux et Systèmes d’Information (IRISI) (FST Marrakech)": "Diplôme d’ingénieur d’État coordonné par Pr. Qassimi Sara à la Faculté des Sciences et Techniques de Marrakech. Langue d’enseignement : français. Objectifs : former des ingénieurs experts en conception, administration et optimisation de réseaux et systèmes d’information, avec compétences en data, cloud, IA et sécurité. Compétences : gestion de projets, leadership, audit réseau, virtualisation, BI, DevOps, IA, deep learning, sécurité applicative, gouvernance des données. Débouchés : chef de projet IRISI, administrateur réseaux & SI, ingénieur DevOps, architecte cloud, data engineer, CDO, consultant IT. Modalités d’accès : dossier, test écrit, entretien. Programme :\n• Sem. 1–2 : Maths, Java OO, OS, réseaux, SI, génie logiciel, back-end, BD.\n• Sem. 3 : ML & RL, front-end, mobile, vision, IA & IoT.\n• Sem. 4 : Agile & DevOps, BI & data warehouse, programmation concurrente, cloud.\n• Sem. 5 : NLP & analytics, deep learning & generative AI, big data & gouvernance, sécurité services ,Innovation et avancées technologiques dans les projets Langues etrangéres ( français /anglais),Employment skills.\n Sem.6 : PFE \n URL : https://www.uca.ma/fr/formations/formation-initiale/ingenierie-en-reseaux-informatique-et-systemes-dinformation-irisi"
}
