{
  "Comment postuler à la FST en tant que bachelier ?": "1. Accédez au site du Ministère ou FST Marrakech pour consulter le classement national (filière scientifique). 2. Si accepté, suivez les instructions pour confirmer votre inscription (dates en juillet). 3. Déposez votre dossier administratif (CIN, Bac, relevés, photo, etc.) au service scolarité à la FST après convocation.",

  "Comment s'inscrire en formation continue ?": "La FST propose form. continue (ex. Génie Civil, Informatique, Maintenance, e‑MIBI). Consultez les fiches détaillées sur le site (page formation continue), remplissez la pré‑inscription en ligne, puis soumettez les pièces demandées via e‑candidature ou au secrétariat concerné :contentReference[oaicite:1]{index=1}.",

  "Quels sont les masters disponibles et comment postuler ?": "La liste 2024‑2025 inclut : Biotechnologie végétale, Modélisation des données, Génie électrique, Matériaux énergie, ChemBioNat, Physico‑chimie, Géoressources, IA & ingénierie info :contentReference[oaicite:2]{index=2}. Procédure : pré‑inscription en ligne → test écrit → entretien oral (dates en juillet). Dépôt du dossier papier le jour de l’oral (fiche de renseignements, relevés, Bac, CIN). :contentReference[oaicite:3]{index=3}",

  "Quand ont lieu les concours masters et inscriptions ?": "Candidatures en ligne jusqu’au 20 juillet 2024 ; tests écrits & oraux en fin juillet (25‑29) ; affichage et inscriptions des admis du 31/07 au 02/08 (principaux) et du 04/09 au 05/09 (attente). :contentReference[oaicite:4]{index=4}",

  "Que contient le dossier papier au concours master ?": "À remettre le jour J : fiche de renseignements signée, copies certifiées des relevés semestres 1‑6, copie du Bac, photocopie CIN, CV, lettre de motivation (facultatif). :contentReference[oaicite:5]{index=5}",

  "Comment maximiser mes chances d'admission au master ?": "D'après des étudiants : > «Faire des stages…, s’investir avec ses profs… lettre de motiva- tion personnalisée» :contentReference[oaicite:6]{index=6}. Cross-check : participer en TD, se faire recommander, anglais validé (Linguaskill). :contentReference[oaicite:7]{index=7}",

  "La FST est-elle difficile ?": "Selon certains témoignages, les études à la FST sont exigeantes (travail personnel intensif, gestion du temps). > «You can be as good … as your effort allows» :contentReference[oaicite:8]{index=8}",

  "Qu'est-ce que le cycle d’ingénieur ?": "Cursus de 3 ans après Bac+2/DEUST/DEUG/licence, avec des filières comme GMP, GC, IRSI, ISA, etc. Sélection via concours (pré‑inscription, écrit, oral). Pièces à fournir et calendrier définis (ex. juillet 2024). :contentReference[oaicite:9]{index=9}",

  "Quelles passerelles entre filières existent ?": "Via le système LMD, les titulaires de DEUST/DEUG/DUT peuvent accéder à la LST ou au cycle ingénieur, selon prérequis. Les masters validés peuvent aussi ouvrir accès à la 2ᵉ année du cycle ingénieur. :contentReference[oaicite:10]{index=10}",

  "Comment se passe l'après-master ?": "Les diplômés trouvent des postes dans l’ingénierie, la R&D, l’enseignement, le conseil. Les salaires de départ seraient pour certains entre 8 000 et 12 500 MAD. :contentReference[oaicite:11]{index=11}",
  
  "FST Marrakech en chiffres": "• Étudiants inscrits : 3 454 (2024–2025) ; • Enseignants-chercheurs : 113 ; • Lauréats à ce jour : +10 000 ; • Filières : environ 30 (Licence, Master, Ingénieur). :contentReference[oaicite:1]{index=1}",

  "Quels sont les horaires de la FST Marrakech ?": "Les cours sont généralement programmés du lundi au vendredi, environ de 08 h à 18 h selon les emplois du temps. Les horaires peuvent varier selon les départements et modules (à consulter sur le portail ou le planning E‑Services). :contentReference[oaicite:2]{index=2}",

  "Comment accéder au wifi sur le campus ?": "Le wifi 'Campus connecté' est accessible via un compte institutionnel UC@Student ou UC@Mobile. Suivez le guide de connexion (Android, iOS, Windows, MacOS) disponible sur le site E‑Services. :contentReference[oaicite:3]{index=3}",

  "La FST a‑t‑elle un restaurant universitaire ?": "Non, il n’y a pas de restaurant universitaire actuellement sur le campus FST Marrakech. Vous trouverez des cafés et restaurants à proximité dans le quartier Guéliz. :contentReference[oaicite:4]{index=4}",

  "Quels sont les accès bibliothèques et leurs horaires ?": "📚 La FST dispose d’une bibliothèque universitaire située au 112 Bd Abdelkrim El Khattabi. En revanche aucun horaire n’est précisé en ligne : il est ouvert probablement en semaine selon les cours. Vérifiez les horaires affichés à l’entrée ou sur l’espace E‑Services. :contentReference[oaicite:5]{index=5}",

  "L’accès à la bibliothèque est‑il réservé aux étudiants ?": "Oui, l’accès est réservé aux étudiants et enseignants de la FST, via authentification sur place ou avec carte universitaire. Certains espaces et postes informatiques sont disponibles pour vos recherches.",

  "Qu’est‑ce que la cité universitaire ?": "La FST est desservie par des cités universitaires séparées filles/garçons gérées par l’Université Cadi Ayyad. L’admission s’effectue via le service social ou affaires étudiantes selon l’affectation nationale.",

  "Quels clubs étudiants existe‑t‑il à la FST ?": "Plusieurs clubs scientifiques, technologiques, culturels (robotique, IA, associations estudiantines). Renseignez‑vous auprès du bureau de la vie associative (espace clubs sur E‑Services ou affichages sur place).",

  "Comment consulter mon emploi du temps ?": "Connectez-vous sur le portail E‑Services (ou UC@Student), section Emploi du temps / Horaires. Le planning y est publié au début de chaque semestre (ex. début septembre pour l’automne).",

  "Comment consulter mes notes et relevés ?": "Accédez à la plateforme E‑Services via authentification. Rendez‑vous dans 'Consultation des notes du T.C.' pour voir vos résultats semestriels. :contentReference[oaicite:6]{index=6}"
}
